tap "adoptopenjdk/openjdk"
tap "azure/functions"
tap "homebrew/bundle"
tap "homebrew/services"
brew "jpeg-xl"
brew "autoconf"
brew "python@3.12"
brew "awscli"
brew "glib"
brew "libidn2"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "emacs"
brew "cask"
brew "libssh"
brew "qemu"
brew "lima"
brew "colima"
brew "curl"
brew "docker"
brew "docker-compose"
brew "freetds"
brew "gimme-aws-creds"
brew "git"
brew "gnupg"
brew "guile"
brew "node"
brew "http-server"
brew "kcat"
brew "lftp"
brew "libfido2"
brew "libpq"
brew "maven"
brew "mysql"
brew "nghttp2"
brew "openjdk@11"
brew "openldap"
brew "php"
brew "poetry"
brew "postgresql@14"
brew "pyenv"
brew "python@3.10"
brew "python@3.11"
brew "python@3.9"
brew "rust"
brew "saml2aws"
brew "talisman"
brew "terraform"
brew "vim"
brew "yazi"
brew "zsh"
cask "1password", args: { appdir: "/Applications" }
cask "1password-cli", args: { appdir: "/Applications" }
cask "alt-tab", args: { appdir: "/Applications" }
cask "arc"
cask "aws-vpn-client"
cask "balance-lock", args: { appdir: "/Applications" }
cask "brave-browser", args: { appdir: "/Applications" }
cask "google-chrome", args: { appdir: "/Applications" }
cask "google-cloud-sdk", args: { appdir: "/Applications" }
cask "insomnia", args: { appdir: "/Applications" }
cask "intellij-idea-ce", args: { appdir: "/Applications" }
cask "iterm2", args: { appdir: "/Applications" }
cask "laravel-kit", args: { appdir: "/Applications" }
cask "logi-options+", args: { appdir: "/Applications" }
cask "microsoft-auto-update"
cask "microsoft-office", args: { appdir: "/Applications" }
cask "microsoft-remote-desktop", args: { appdir: "/Applications" }
cask "microsoft-teams"
cask "ngrok", args: { appdir: "/Applications" }
cask "pgadmin4"
cask "postman", args: { appdir: "/Applications" }
cask "pycharm-ce"
cask "rancher", args: { appdir: "/Applications" }
cask "raycast", args: { appdir: "/Applications" }
cask "rectangle", args: { appdir: "/Applications" }
cask "slack", args: { appdir: "/Applications" }
cask "spotify", args: { appdir: "/Applications" }
cask "tableplus", args: { appdir: "/Applications" }
cask "todoist", args: { appdir: "/Applications" }
cask "visual-studio-code", args: { appdir: "/Applications" }
cask "warp", args: { appdir: "/Applications" }
cask "xampp-vm", args: { appdir: "/Applications" }
cask "zoom", args: { appdir: "/Applications" }
vscode "alefragnani.project-manager"
vscode "codezombiech.gitignore"
vscode "donjayamanne.git-extension-pack"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "hashicorp.terraform"
vscode "hbenl.vscode-test-explorer"
vscode "kevinrose.vsc-python-indent"
vscode "kreativ-software.csharpextensions"
vscode "meezilla.json"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-ossdata.vscode-postgresql"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.test-adapter-converter"
vscode "postman.postman-for-vscode"
vscode "qwtel.sqlite-viewer"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-xml"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "yuvraj.json-scape-unscape"
vscode "zainchen.json"
vscode "ziyasal.vscode-open-in-github"
